<?php

return 
[
    "login" => [
        "success" => "تم تسجيل الدخول بنجاح",
        "failed" => "فشل تسجيل الدخول",
        "invalid_credentials" => "بيانات الاعتماد غير صحيحة",
    ],
    "logout" => [
        "success" => "تم تسجيل الخروج بنجاح",
        "failed" => "فشل تسجيل الخروج",
    ],
    "renew" => [
        "success" => "تم تحديث كلمة المرور بنجاح",
        "failed" => "فشل تحديث كلمة المرور",
        "user_not_found" => "المستخدم غير موجود",
    ],
    "user" => [
        "success" => "تم استرجاع معلومات المستخدم بنجاح",
        "not_found" => "المستخدم غير موجود",
    ],
    "register" => [
        "success" => "تم تسجيل المستخدم بنجاح",
        "failed" => "فشل تسجيل المستخدم",
        "email_exists" => "البريد الإلكتروني موجود بالفعل",
    ],
    "validation" => [
        "name_required" => "حقل الاسم مطلوب.",
        "email_required" => "حقل البريد الإلكتروني مطلوب.",
        "email_email" => "يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.",
        "email_unique" => "تم أخذ البريد الإلكتروني بالفعل.",
        "password_required" => "حقل كلمة المرور مطلوب.",
        "password_confirmed" => "تأكيد كلمة المرور غير متطابق.",
        'title_required' => 'حقل العنوان مطلوب.',
        'title_string' => 'يجب أن يكون العنوان سلسلة نصية.',
        'title_max' => 'قد لا يتجاوز العنوان 255 حرفًا.',
        'content_required' => 'حقل المحتوى مطلوب.',
        'content_string' => 'يجب أن يكون المحتوى سلسلة نصية.',


    ],

   "post" => [
    "get_all" => "تم استرجاع المنشورات بنجاح",
    "get" => "تم استرجاع المنشور بنجاح",
    "get_failed" => "فشل في استرجاع المنشورات",
    "not_found" => "المنشور غير موجود",
    "created" => "تم إنشاء المنشور بنجاح",
    "create_failed" => "فشل في إنشاء المنشور",
    "updated" => "تم تحديث المنشور بنجاح",
    "update_failed" => "فشل في تحديث المنشور",
    "deleted" => "تم حذف المنشور بنجاح",
    "delete_failed" => "فشل في حذف المنشور",
    "restored" => "تم استعادة المنشور بنجاح",
    "restore_failed" => "فشل في استعادة المنشور",
    "get_all_deleted" => "تم استرجاع المنشورات المحذوفة بنجاح",
    "no_ids_provided" => "لم يتم توفير معرفات للحذف الجماعي",
    "bulk_deleted" => "تم حذف المنشورات بنجاح",
    "bulk_delete_failed" => "فشل في حذف المنشورات",
    "bulk_restored" => "تم استعادة المنشورات بنجاح",
    "bulk_restore_failed" => "فشل في استعادة المنشورات",
    "bulk_force_delete_failed" => "فشل في الحذف النهائي للمنشورات",
    "partial_bulk_deleted" => "بعض المنشورات لم يتم حذفها بنجاح",
    "partial_bulk_restored" => "بعض المنشورات لم يتم استعادتها بنجاح",
    "partial_bulk_force_deleted" => "بعض المنشورات لم يتم حذفها نهائيًا بنجاح",
    "bulk_force_deleted" => "تم حذف المنشورات نهائيًا بنجاح",
]
];
